In [1]:
1+2

3

In [8]:
import pandas as pd

In [4]:
from math import sin

In [5]:
sin(1)

0.8414709848078965

In [7]:
pwd()

'/home/rchen5597/rchen_test_0606'

In [9]:
s = pd.Series([3, -5, 7, 4],  index=['a',  'b',  'c',  'd'])

In [10]:
data = {'Country': ['Belgium',  'India',  'Brazil'],
'Capital': ['Brussels',  'New Delhi',  'Brasilia'],
'Population': [11190846, 1303171035, 207847528]}

df = pd.DataFrame(data, columns=['Country',  'Capital',  'Population'])

In [14]:
pd.read_csv('/home/rchen5597/dssg-europe-syllabus/07_PYTHON_python_for_data_analysis/data/chicago_past_year_crimes.csv', header=None, nrows=5)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16
0,CASE#,DATE OF OCCURRENCE,BLOCK,IUCR,PRIMARY DESCRIPTION,SECONDARY DESCRIPTION,LOCATION DESCRIPTION,ARREST,DOMESTIC,BEAT,WARD,FBI CD,X COORDINATE,Y COORDINATE,LATITUDE,LONGITUDE,LOCATION
1,JB241987,04/28/2018 10:05:00 PM,009XX N LONG AVE,2092,NARCOTICS,SOLICIT NARCOTICS ON PUBLICWAY,SIDEWALK,Y,N,1524,37,18,1140136,1905903,41.897894893,-87.760743714,"(41.897894893, -87.760743714)"
2,JA430240,09/06/2017 01:30:00 PM,032XX W 26TH ST,0810,THEFT,OVER $500,OTHER,Y,N,1024,12,06,1155313,1886555,41.844510467,-87.705519454,"(41.844510467, -87.705519454)"
3,JB241350,04/28/2018 08:00:00 AM,008XX E 53RD ST,1320,CRIMINAL DAMAGE,TO VEHICLE,STREET,N,N,233,5,14,1182892,1870055,41.798635468,-87.604823241,"(41.798635468, -87.604823241)"
4,JB245397,04/28/2018 09:00:00 AM,062XX S MICHIGAN AVE,0820,THEFT,$500 AND UNDER,RESIDENCE PORCH/HALLWAY,N,N,311,20,06,1178263,1863570,41.780946398,-87.621995369,"(41.780946398, -87.621995369)"

In [12]:
! ls

notebook_0606.ipynb

In [13]:
pwd()

'/home/rchen5597/rchen_test_0606'

In [15]:
df.to_csv('myDataFrame.csv')

In [16]:
df.shape

(3, 3)

In [17]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [18]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
Country       3 non-null object
Capital       3 non-null object
Population    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [20]:
df.count()

Country       3
Capital       3
Population    3
dtype: int64

In [21]:
df.sum()

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasilia
Population                   1522209409
dtype: object

In [22]:
df.cumsum()

              Country                    Capital  Population
0             Belgium                   Brussels    11190846
1        BelgiumIndia          BrusselsNew Delhi  1314361881
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrasilia  1522209409

In [23]:
df.min()

Country        Belgium
Capital       Brasilia
Population    11190846
dtype: object

In [24]:
df.max()

Country            India
Capital        New Delhi
Population    1303171035
dtype: object

In [25]:
df.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [26]:
df.mean()

Population    5.074031e+08
dtype: float64

In [27]:
df.median()

Population    207847528.0
dtype: float64

In [28]:
df.ix[2]

/home/rchen5597/.conda/envs/test/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Country          Brazil
Capital        Brasilia
Population    207847528
Name: 2, dtype: object

In [29]:
df.ix[2]

/home/rchen5597/.conda/envs/test/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Country          Brazil
Capital        Brasilia
Population    207847528
Name: 2, dtype: object

In [30]:
s[~(s > 1)]

b   -5
dtype: int64

In [31]:
s[(s < -1) | (s > 2)]

a    3
b   -5
c    7
d    4
dtype: int64

In [32]:
df[df['Population']>1200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035

In [33]:
s['a'] = 6

In [34]:
s.drop(['a',  'c'])

b   -5
d    4
dtype: int64

In [35]:
df.drop('Country', axis=1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasilia   207847528

In [36]:
df.sort_index()

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [37]:
df.sort_values(by='Country')

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasilia   207847528
1    India  New Delhi  1303171035

In [38]:
df.rank()

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0